# AddCustomHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlesData..::..AddCustomHandle Method
RebarHandlesData Class See Also
---
Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void AddCustomHandle(
	int customHandleTag
)
```

Visual Basic
---
```text
Public Sub AddCustomHandle ( _
	customHandleTag As Integer _
)
```

Visual C++
---
```text
public:
void AddCustomHandle(
	int customHandleTag
)
```

# ### Parameters
customHandleTag
    Type: System..::..Int32 The tag of the handle. The tag should be different from the previous ones that were added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | customHandleTag is a duplicate tag. |

# See Also
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace